package org.c0nstexpr.fishology.log

private val magicCharms = arrayOf(
    "你怎么知道我今天钓上了一条大鱼？",
    "你现在不能休息，周围有PVP大佬在游荡",
    "对僵尸使用镐击能造成显著伤害",
    "已加入新附魔-海之嫌弃",
    "向脚下挖掘能提高钻石的生成率",
    "岩浆+日志=黑曜石",
    "已添加Herobrine到游戏中",
    "/summon Minecraft:exception ~ ~ ~ {StackDepth:64}",
    "在战斗中可以按Q释放剑气",
    "末影人讨厌卑鄙的两格人",
    "模组加载好了不用是什么意思",
    "瑞典原神，启动！",
    "已加载新的工作台合成配方：石头工作台，凋灵合成，线斧，土豆柄锄头，粗柄铁镐，钻石柄木镐等",
    "别人的世界大别野，我的只有火柴盒",
    "模组里只有科学与特性，没有漏洞",
    "正在加载带有命令块的《我的世界》",
    "是时候该有人在痴呆症的影响下来通关游戏了，这真的可能吗？真的能够完成吗？",
    "请不要在模组菜单上点来点去",
    "作者被刻意的代码设计鲨了",
    "作者在逃离漏洞时试图在异常里游泳",
    "作者发现了代码是漏洞堆起来的",
    "作者掉出了这个进程",
    "作者与JVM不共戴天",
    "作者在试图逃离异常时感受到了动能",
    "为什么我的模组没有声音",
    "我是钓鱼佬，这是新鱼",
    "我一个函数调出四个错误，一定是OptiFine干的！",
    "我们物品栏先进的64进制已经完全超越了老式的二进制"
)

fun spell(): String = magicCharms.random()
