package org.c0nstexpr.fishology.log

private val wisdom = arrayOf(
    "你现在不能休息，周围有PVP大佬在游荡",
    "我们可以对僵尸使用镐击",
    "BugJump也许应该考虑给加海之嫌弃的附魔",
    "MC的漏洞也是刻意的游戏设计一种",
    "向脚下挖掘能提高钻石的生成率",
    "岩浆+日志=黑曜石",
    "年轻时诋毁Herobrine，懂事时理解Herobrine，成熟时成为Herobrine",
    "/summon Gradle:exception ~ ~ ~ {StackDepth:64}",
    "在战斗中可以按Q释放剑气",
    "末影人不喜欢卑鄙的两格人",
    "MOD做好了不启动是什么意思",
    "瑞典原神，启动！",
    "我们已经在Mod中加入了新的合成配方，包括石头工作台，凋灵合成，线斧，土豆柄锄头，粗柄铁镐，钻石柄木镐等",
    "别人的世界大别野，我的只有火柴盒",
    "在MC里只是科学，不是Bug",
    "正在加载带有命令块的《我的世界》",
    "是时候该有人在痴呆症的影响下来通关游戏了，这真的可能吗？真的能够完成吗？",
    "请不要在毕业红毯上飞来飞去",
    "作者在逃离bug时试图在异常里游泳",
    "作者发现了代码是bug堆起来的",
    "作者掉出了这个进程",
    "作者与JVM不共戴天",
    "作者在试图逃离异常时感受到了动能",
    "为什么我的MOD没有声音",
    "我一个函数调出四个错误，一定是OptiFine干的！",
    "我们物品栏先进的64进制已经完全超越了老式的二进制"
)

fun getWisdom(): String = wisdom.random()
